StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_cmd.c
		parm->ec_id = MGNT_TX_WK_CID;
		parm->type = 0;
		parm->size = sizeof(*mgnt_parm);
		parm->pbuf = (u8 *)mgnt_parm;

		cmdobj = (struct cmd_obj *)rtw_zmalloc(sizeof(*cmdobj));
		if (cmdobj == NULL) {
			res = _FAIL;
			rtw_mfree((u8 *)mgnt_parm, sizeof(*mgnt_parm));
			rtw_mfree((u8 *)parm, sizeof(*parm));
			goto exit;
		}

		init_h2fwcmd_w_parm_no_rsp(cmdobj, parm, CMD_SET_DRV_EXTRA);

		if (flags & RTW_CMDF_WAIT_ACK) {
			cmdobj->sctx = &sctx;
			rtw_sctx_init(&sctx, 10 * 1000);
		}

		res = rtw_enqueue_cmd(pcmdpriv, cmdobj);

		if (res == _SUCCESS && (flags & RTW_CMDF_WAIT_ACK)) {
			rtw_sctx_wait(&sctx, __func__);
			_enter_critical_mutex(&pcmdpriv->sctx_mutex, NULL);
			if (sctx.status == RTW_SCTX_SUBMITTED) {
				cmdobj->sctx = NULL;
			}
			_exit_critical_mutex(&pcmdpriv->sctx_mutex, NULL);
			if (sctx.status != RTW_SCTX_DONE_SUCCESS) {
				res = _FAIL;
			}
		}
	}

exit:
	return res;
}
#endif

u8 rtw_ps_cmd(_adapter *padapter)
{
	struct cmd_obj		*ppscmd;
	struct drvextra_cmd_parm	*pdrvextra_cmd_parm;
	struct cmd_priv	*pcmdpriv = &padapter->cmdpriv;

	u8	res = _SUCCESS;

#ifdef CONFIG_CONCURRENT_MODE
	if (!is_primary_adapter(padapter)) {
		goto exit;
	}
#endif

	ppscmd = (struct cmd_obj *)rtw_zmalloc(sizeof(struct cmd_obj));
	if (ppscmd == NULL) {
		res = _FAIL;
		goto exit;
	}

	pdrvextra_cmd_parm = (struct drvextra_cmd_parm *)rtw_zmalloc(sizeof(struct drvextra_cmd_parm));
	if (pdrvextra_cmd_parm == NULL) {
		rtw_mfree((unsigned char *)ppscmd, sizeof(struct cmd_obj));
		res = _FAIL;
		goto exit;
	}

	pdrvextra_cmd_parm->ec_id = POWER_SAVING_CTRL_WK_CID;
	pdrvextra_cmd_parm->type = 0;
	pdrvextra_cmd_parm->size = 0;
	pdrvextra_cmd_parm->pbuf = NULL;
	init_h2fwcmd_w_parm_no_rsp(ppscmd, pdrvextra_cmd_parm, CMD_SET_DRV_EXTRA);

	res = rtw_enqueue_cmd(pcmdpriv, ppscmd);

exit:


	return res;

}

#if CONFIG_DFS
void rtw_dfs_ch_switch_hdl(struct dvobj_priv *dvobj)
{
	struct rf_ctl_t *rfctl = dvobj_to_rfctl(dvobj);
	_adapter *pri_adapter = dvobj_get_primary_adapter(dvobj);
	struct mlme_ext_priv *pmlmeext = &pri_adapter->mlmeextpriv;
	u8 ifbmp_m = rtw_mi_get_ap_mesh_ifbmp(pri_adapter);
	u8 ifbmp_s = rtw_mi_get_ld_sta_ifbmp(pri_adapter);
	s16 req_ch;
	u8 req_bw = CHANNEL_WIDTH_20, req_offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE, csa_timer = _FALSE;

	rtw_hal_macid_sleep_all_used(pri_adapter);

	if (rtw_chset_search_ch(rfctl->channel_set, rfctl->csa_ch) >= 0
	    && !rtw_chset_is_ch_non_ocp(rfctl->channel_set, rfctl->csa_ch)
	   ) {
		/* CSA channel available and valid */
		req_ch = rfctl->csa_ch;
		RTW_INFO("%s valid CSA ch%u\n", __func__, rfctl->csa_ch);
		csa_timer = _TRUE;
	} else if (ifbmp_m) {
		/* no available or valid CSA channel, having AP/MESH ifaces */
		req_ch = REQ_CH_NONE;
		RTW_INFO("%s ch sel by AP/MESH ifaces\n", __func__);
	} else {
		/* no available or valid CSA channel and no AP/MESH ifaces */
		if (!IsSupported24G(dvobj_to_regsty(dvobj)->wireless_mode)
#ifdef CONFIG_DFS_MASTER
		    || rfctl->radar_detected
#endif
		   ) {
			req_ch = 36;
		} else {
			req_ch = 1;
		}
		RTW_INFO("%s switch to ch%d\n", __func__, req_ch);
	}

	/* only support 80 Mhz so far */
	if (rfctl->csa_ch_width == 1 || rfctl->csa_ch_width == 2 || rfctl->csa_ch_width == 3) {
		if (rtw_get_offset_by_chbw(req_ch, CHANNEL_WIDTH_80, &req_offset)) {
			req_bw = CHANNEL_WIDTH_80;
		} else {
			req_bw = CHANNEL_WIDTH_20;
			req_offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;
		}
	} else if (rfctl->csa_ch_offset == 1) {
		req_bw = CHANNEL_WIDTH_40;
		req_offset = HAL_PRIME_CHNL_OFFSET_LOWER;
	} else if (rfctl->csa_ch_offset == 3) {
		req_bw = CHANNEL_WIDTH_40;
		req_offset = HAL_PRIME_CHNL_OFFSET_UPPER;
	} else {
		req_bw = CHANNEL_WIDTH_20;
		req_offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;
	}

	RTW_INFO("req_ch=%d, req_bw=%d, req_offset=%d, ifbmp_m=0x%02x, ifbmp_s=0x%02x\n"
		 , req_ch, req_bw, req_offset, ifbmp_m, ifbmp_s);

	/*  update ch, bw, offset for all asoc STA ifaces */
	if (ifbmp_s) {
		_adapter *iface;
		int i;

		for (i = 0; i < dvobj->iface_nums; i++) {
			iface = dvobj->padapters[i];
			if (!iface || !(ifbmp_s & BIT(iface->iface_id))) {
				continue;
			}

			if (req_ch == REQ_CH_NONE) {
				set_fwstate(&iface->mlmepriv,  WIFI_OP_CH_SWITCHING);
				issue_deauth(iface, get_bssid(&iface->mlmepriv), WLAN_REASON_DEAUTH_LEAVING);
			} else {
				/* update STA mode ch/bw/offset */
				iface->mlmeextpriv.cur_channel = req_ch;
				iface->mlmeextpriv.cur_bwmode = req_bw;
				iface->mlmeextpriv.cur_ch_offset = req_offset;
				/* updaet STA mode DSConfig , ap mode will update in rtw_change_bss_chbw_cmd */
				iface->mlmepriv.cur_network.network.Configuration.DSConfig = req_ch;
				set_fwstate(&iface->mlmepriv, WIFI_CSA_UPDATE_BEACON);

#ifdef CONFIG_80211D
				if (iface->mlmepriv.recv_country_ie) {
					if (rtw_apply_recv_country_ie_cmd(iface, RTW_CMDF_DIRECTLY
									  , req_ch > 14 ? BAND_ON_5G : BAND_ON_2_4G, req_ch
									  , iface->mlmepriv.recv_country_ie) != _SUCCESS
					   ) {
						RTW_WARN(FUNC_ADPT_FMT" rtw_apply_recv_country_ie_cmd() fail\n", FUNC_ADPT_ARG(iface));
					}
				}
#endif
			}
		}
	}

	if (csa_timer) {
		RTW_INFO("pmlmeext->csa_timer 70 seconds\n");
		/* wait 70 seconds for receiving beacons */
		_set_timer(&pmlmeext->csa_timer, CAC_TIME_MS + 10000);
	}

#ifdef CONFIG_AP_MODE
	if (ifbmp_m) {
		u8 execlude = 0;

		if (req_ch == REQ_CH_NONE) {
			execlude = ifbmp_s;
		}
		/* trigger channel selection with consideraton of asoc STA ifaces */
		rtw_change_bss_chbw_cmd(dvobj_get_primary_adapter(dvobj), RTW_CMDF_DIRECTLY
					, ifbmp_m, execlude, req_ch, REQ_BW_ORI, REQ_OFFSET_NONE);
	} else
#endif
	{
		/* no AP/MESH iface, switch DFS status and channel directly */
		rtw_warn_on(req_ch <= 0);
#ifdef CONFIG_DFS_MASTER
		rtw_dfs_rd_en_decision(pri_adapter, MLME_OPCH_SWITCH, 0);
#endif
		LeaveAllPowerSaveModeDirect(pri_adapter);
		set_channel_bwmode(pri_adapter, req_ch, req_offset, req_bw);
		/* update union ch/bw/offset for STA only */
		rtw_mi_update_union_chan_inf(pri_adapter, req_ch, req_offset, req_bw);
		rtw_rfctl_update_op_mode(rfctl, 0, 0);
	}

	/* make asoc STA ifaces disconnect */
	if (ifbmp_s && req_ch == REQ_CH_NONE) {
		_adapter *iface;
		int i;

		for (i = 0; i < dvobj->iface_nums; i++) {
			iface = dvobj->padapters[i];
			if (!iface || !(ifbmp_s & BIT(iface->iface_id))) {
				continue;
			}
			rtw_disassoc_cmd(iface, 0, RTW_CMDF_DIRECTLY);
			rtw_indicate_disconnect(iface, 0, _FALSE);
			rtw_free_assoc_resources(iface, _TRUE);
			rtw_free_network_queue(iface, _TRUE);
		}
	}

